[ {
  "courseCode" : "Fundamental Topics in Programming",
  "courseSemester" : "Spring",
  "courseName" : "CE216",
  "prerequisites" : "SE116",
  "teachingMethods" : "Group Work Application: Experiment / Laboratory / Workshop Lecture / Presentation",
  "courseType" : "Required",
  "courseObj" : "This course introduces the practicalities of programming to studentsto improve their practical skills. Students will be exposed tocommonly used libraries, methodologies, tools, and APIs byexperiencing them first in theory, then in practical laboratory sessions.",
  "outcomes" : "The students who succeed in this course will be able to,● Implement advanced programs that accomplish the intendedtask,● Identify fundamental design patterns,● Use threads to apply concurrent execution,● Examine the program to locate and remove bugs,● Use test driven development to create robust programs,● Design an experiment to improve the performance of aprogram,● Operate as part of a team to develop a project.",
  "courseDesc" : "The course covers programming topics such as; File I/O, objectoriented design, JavaFX, design patterns, concurrency, debugging, testing, and profiling.",
  "courseCoordinator" : "Assoc. Prof. Dr. Kaya Oğuz",
  "courseLecturer" : "Assoc. Prof. Dr. Kaya Oğuz",
  "assistant" : "-",
  "reading" : "Java in Two Semesters, Fourth Edition, Quentin Charatan andAaron Kans. Springer, 2019. ISBN: 9783319994192.The Practice of Programming, Brian W. Kernighan and RobPike. Addison-Wesley, 1999. ISBN: 9780201615869.Programming Pearls, Jon Bentley. Addison-Wesley, 2000.ISBN: 9788177588583.Design Patterns: Elements of Reusable Object-OrientedSoftware, Erich Gamma and Richard Helm and Ralph Johnsonand John Vlissides. Addison-Wesley, 1995. ISBN:9780201633610",
  "textbook" : "Java How to Program, 10/e (Early Objects), Global Edition,Paul Deitel and Harvey Deitel. Pearson, ISBN: 9781292018195",
  "courseLang" : "English",
  "courseCategory" : "Core Course",
  "courseLevel" : "First Cycle",
  "delivery" : "Face-to-Face",
  "theoryTime" : 2,
  "labTime" : 2,
  "courseCredit" : 3,
  "courseECTS" : 6
} ]